import { PixelRatio, SafeAreaView, Text, View } from "react-native"
import tw from "twrnc"

const PrivacyScreen = () => {
    const fonScale = PixelRatio.getFontScale()
    return (
        <>
            <SafeAreaView style={tw`flex-1 items-center justify-center bg-white`}>
                <Text style={tw`font-900 text-[${fonScale * 18}px] text-indigo-500`}>سياسة الخصوصية</Text>
                <View style={tw`justify-center p-5`}>
                    <Text style={tw`py-2 font-bold`}>• يتم جمع المعلومات الشخصية التي تقدمها أثناء استخدام هذا التطبيق ويجب أن يتم جمع واستخدام هذه المعلومات وفقًا لسياسة الخصوصية الخاصة بالتطبيق.</Text>
                    <Text style={tw`py-2 font-bold`}>• توضح سياسة الخصوصية كيفية جمع واستخدام البيانات الشخصية ومن يمكن الوصول إليها، بالإضافة إلى كيفية تخزينها وحذفها.</Text>
                    <Text style={tw`py-2 font-bold`}>• يتم استخدام ملفات تعريف الارتباط (Cookies) وتقنيات مماثلة لجمع المعلومات عند استخدام التطبيق وتحسين تجربة المستخدم.</Text>
                    <Text style={tw`py-2 font-bold`}>• يرجى ملاحظة أن الشروط والأحكام وسياسة الخصوصية المحددة للتطبيق  قد تختلف بين البلدان ويمكن أن تتغير مع الوقت. لذلك، يجب عليك قراءة شروط الاستخدام وسياسة الخصوصية الخاصة بتطبيق صّيف قبل استخدامه.</Text>
                    <Text style={tw`py-2 font-bold`}>• قد تحتوي خدماتنا على روابط لتطبيقات وخدمات وأدوات ومواقع تابعة لجهات خارجية لا نتحكم فيها أو نديرها ويمكن أن يستخدمها المستخدم؛ أي أننا لسنا مسؤولين عن أمن أو خصوصية أي معلومات تقوم هذه الجهات الخارجية بجمعها. لذا ينبغي للمستخدم مراجعة سياسات الخصوصية المطبقة على خدمات الجهات الخارجية المذكورة. لا تغطي سياسة الخصوصية الماثلة المعلومات والبيانات التي يقدمها المستخدم لشركات خارجية.</Text>
                    <Text style={tw`py-2 font-bold`}>• قد نقوم بتحديث سياسة الخصوصية الماثلة من وقت لآخر حسب ما نراه ضروريًا. وفي حال إجراء أي تغييرات جوهرية على سياسة الخصوصية</Text>
                </View>
            </SafeAreaView>
        </>
    )
}
export default PrivacyScreen